import style from "./solutionServices.module.css";
import SolutionsArrow from "../svgComponents/solutionsArrow";
import {useRef, useEffect} from "react";
import DecorativeSquare from "../decorative/decorativeSquare";

const SolutionServices = () => {

  const mainRef = useRef();
  const serviceRef = useRef();
  const mainAfter = useRef();
  const card1 = useRef();const card2 = useRef();const card3 = useRef();const card4 = useRef();
  const card5 = useRef();const card6 = useRef();const card7 = useRef();const card8 = useRef();

  const APP_WRAPPER_MAX_WIDTH = 1200;
  const APP_WRAPPER_WIDTH = 0.95;
  const SERVICES_HEIGHT = 3900;

  const onScroll = () => {
    const distanceToTop = serviceRef.current.getBoundingClientRect().top;

    // Двигаем блок

    if (distanceToTop >= 0) {
      mainRef.current.style.position = "absolute";
      mainRef.current.style.top = "0";
      mainRef.current.style.left = "0";
      mainRef.current.style.width = "100%";
    }
    else if (distanceToTop < 0 && distanceToTop > document.documentElement.clientHeight - SERVICES_HEIGHT){
      const clientWidth = document.documentElement.clientWidth;
      let left; let width;

      if (clientWidth > APP_WRAPPER_MAX_WIDTH/APP_WRAPPER_WIDTH) {
        left = `calc(${(clientWidth - APP_WRAPPER_MAX_WIDTH)/2}px)`;
        width="1200px";
      }
      else {
        left="2.5%";
        width="95%";
      }

      mainRef.current.style.position = "fixed";
      mainRef.current.style.top = 0;
      mainRef.current.style.left = left;
      mainRef.current.style.width = width;
    }
    else {
      mainRef.current.style.position="absolute";
      mainRef.current.style.left = "0";
      mainRef.current.style.width = "100%";
      mainRef.current.style.top = `${SERVICES_HEIGHT - document.documentElement.clientHeight}px`;
    }

    // Двигаем карточки
    if (distanceToTop > 0) card1.current.style.transform = `translateY(${distanceToTop}px)`;
    else card1.current.style.transform = `translateY(0px)`;
    if (distanceToTop > -400) card2.current.style.transform = `translateY(${distanceToTop}px)`;
    else card2.current.style.transform = `translateY(-400px)`;
    if (distanceToTop > -800) card3.current.style.transform = `translateY(${distanceToTop}px)`;
    else card3.current.style.transform = `translateY(-800px)`;
    if (distanceToTop > -1200) card4.current.style.transform = `translateY(${distanceToTop}px)`;
    else card4.current.style.transform = `translateY(-1200px)`;
    if (distanceToTop > -1600) card5.current.style.transform = `translateY(${distanceToTop}px)`;
    else card5.current.style.transform = `translateY(-1600px)`;
    if (distanceToTop > -2000) card6.current.style.transform = `translateY(${distanceToTop}px)`;
    else card6.current.style.transform = `translateY(-2000px)`;
    if (distanceToTop > -2400) card7.current.style.transform = `translateY(${distanceToTop}px)`;
    else card7.current.style.transform = `translateY(-2400px)`;
    if (distanceToTop > -2800) card8.current.style.transform = `translateY(${distanceToTop}px)`;
    else card8.current.style.transform = `translateY(-2800px)`;

    //меняем опасити у бэкграунда
    const opacity = (3900 + distanceToTop)/3900;
    mainAfter.current.style.opacity=`${opacity}`;
  }

  useEffect(() => {
    window.addEventListener("scroll", onScroll);
    return () => {
      window.removeEventListener("scroll", onScroll);
    }
  }, [])

  return(
    <section className={style.services} ref={serviceRef}>
      <div className="app-wrapper">

        <div className={style.services__main} ref={mainRef}>

          <div className={style.main__after} ref={mainAfter}></div>

          <h3 className="section__subtitle" style={{textAlign:"left", zIndex:2, position:"relative"}}>Услуги</h3>
          <h2 className="section__title" style={{textAlign:"left", maxWidth:416, zIndex:2, position:"relative"}}>Что входит в стоимость разработки</h2>
          <SolutionsArrow />

          <div className={style.card + " " + style.card1} ref={card1}>
            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M18.6696 0.0757955C19.4843 0.0757955 20.1448 0.735151 20.1448 1.54851C20.1448 2.29408 19.5898 2.91025 18.8698 3.00777L18.6696 3.02122H11.3155C6.35587 3.02122 3.14341 6.30578 2.95873 11.4065L2.95032 11.8752V28.2006C2.95032 33.4171 6.00656 36.8483 10.8685 37.0456L11.3155 37.0546H28.6712C33.6431 37.0546 36.8458 33.7771 37.0299 28.6699L37.0383 28.2006V20.2912C37.0383 19.4778 37.6988 18.8185 38.5135 18.8185C39.2603 18.8185 39.8775 19.3725 39.9752 20.0914L39.9886 20.2912V28.2006C39.9886 34.9989 35.6752 39.7788 29.1313 39.9925L28.6712 40H11.3155C4.67062 40 0.206456 35.3743 0.00697185 28.6716L0 28.2006V11.8752C0 5.08358 4.32451 0.297327 10.8562 0.0832785L11.3155 0.0757955H18.6696ZM27.0848 1.80041C29.4919 -0.600136 33.3931 -0.600136 35.8002 1.80041L38.1945 4.19069C40.6018 6.59403 40.6018 10.492 38.1945 12.8928L23.4252 27.6375C22.3478 28.7132 20.8867 29.3177 19.3629 29.3177H11.995C11.1659 29.3177 10.4997 28.6359 10.5203 27.8084L10.7052 20.3855C10.7423 18.9155 11.3437 17.5154 12.3858 16.4751L27.0848 1.80041ZM25.874 7.172L14.472 18.5578C13.9651 19.0638 13.6726 19.7447 13.6546 20.4592L13.506 26.3706L19.3629 26.3723C20.0114 26.3723 20.6365 26.1472 21.134 25.7402L21.339 25.5548L32.812 14.1L25.874 7.172ZM33.7152 3.88425C32.46 2.63248 30.4251 2.63248 29.1705 3.8837L27.96 5.09L34.898 12.016L36.1089 10.8095C37.2895 9.63206 37.3589 7.76269 36.3167 6.50229L36.1083 6.27341L33.7152 3.88425Z" fill="#200E32"/>
            </svg>
            <p className={style.card__title}>Дизайн</p>
            <p className={style.card__text}>Проектируем логичный пользовательский интерфейс, отрисовываем визуальную часть</p>
            <p className={style.card__number}>01</p>
          </div>

          <div className={style.card + " " + style.card2} ref={card2}>
            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M28.668 0C35.4756 0 40 4.85901 40 11.832V28.168C40 35.1413 35.4752 40 28.666 40H11.33C4.52274 40 0 35.1414 0 28.168V11.832C0 4.86519 4.53485 0 11.33 0H28.668ZM28.668 3H11.33C6.24068 3 3 6.47674 3 11.832V28.168C3 33.5306 6.22952 37 11.33 37H28.666C33.7688 37 37 33.5303 37 28.168V11.832C37 6.46993 33.769 3 28.668 3Z" fill="#200E32"/>
              <path d="M28.1438 14.1246L27.9755 13.9794C27.3884 13.5436 26.555 13.5919 26.0224 14.1244C25.4366 14.7101 25.4365 15.6599 26.0222 16.2457L29.758 19.98L26.0273 23.7127L25.8821 23.881C25.4464 24.4682 25.4948 25.3015 26.0273 25.8341C26.6131 26.4198 27.5629 26.4198 28.1487 25.8341L31.88 22.102L34 19.982L31.878 17.86L28.1438 14.1246Z" fill="#200E32"/>
              <path d="M11.8553 14.1246L12.0235 13.9794C12.6107 13.5436 13.444 13.5919 13.9766 14.1244C14.5624 14.7101 14.5625 15.6599 13.9768 16.2457L10.241 19.98L13.9717 23.7127L14.1169 23.881C14.5526 24.4682 14.5042 25.3015 13.9717 25.8341C13.3859 26.4198 12.4361 26.4198 11.8504 25.8341L8.11902 22.102L5.99902 19.982L8.12102 17.86L11.8553 14.1246Z" fill="#200E32"/>
              <rect x="15.999" y="28.9996" width="19" height="3" rx="1.5" transform="rotate(-75 15.999 28.9996)" fill="#200E32"/>
            </svg>
            <p className={style.card__title}>Программирование</p>
            <p className={style.card__text}>Разрабатываем функциональную и интерактивную части</p>
            <p className={style.card__number}>02</p>
          </div>

          <div className={style.card + " " + style.card3} ref={card3}>
            <svg width="43" height="40" viewBox="0 0 43 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M34.1839 24.3631C38.5529 24.3631 42.1045 27.8689 42.1045 32.1816C42.1045 36.4917 38.5529 40 34.1839 40C29.815 40 26.2633 36.4917 26.2633 32.1816C26.2633 27.8689 29.815 24.3631 34.1839 24.3631ZM34.1839 28.0303C31.8632 28.0303 29.9784 29.8908 29.9784 32.1816C29.9784 34.4699 31.8632 36.3328 34.1839 36.3328C36.5046 36.3328 38.3894 34.4699 38.3894 32.1816C38.3894 29.8908 36.5046 28.0303 34.1839 28.0303ZM17.0887 30.3472C18.1141 30.3472 18.9463 31.1687 18.9463 32.1808C18.9463 33.193 18.1141 34.0144 17.0887 34.0144H1.85929C0.833917 34.0144 0.00173372 33.193 0.00173372 32.1808C0.00173372 31.1687 0.833917 30.3472 1.85929 30.3472H17.0887ZM7.9206 0C12.2896 0 15.8412 3.50828 15.8412 7.81845C15.8412 12.1286 12.2896 15.6369 7.9206 15.6369C3.55412 15.6369 0 12.1286 0 7.81845C0 3.50828 3.55412 0 7.9206 0ZM7.9206 3.66719C5.60238 3.66719 3.71511 5.53012 3.71511 7.81845C3.71511 10.1068 5.60238 11.9697 7.9206 11.9697C10.2413 11.9697 12.1261 10.1068 12.1261 7.81845C12.1261 5.53012 10.2413 3.66719 7.9206 3.66719ZM40.2477 5.98534C41.2731 5.98534 42.1053 6.80679 42.1053 7.81894C42.1053 8.83108 41.2731 9.65253 40.2477 9.65253H25.0158C23.9904 9.65253 23.1582 8.83108 23.1582 7.81894C23.1582 6.80679 23.9904 5.98534 25.0158 5.98534H40.2477Z" fill="#200E32"/>
            </svg>
            <p className={style.card__title}>CMS</p>
            <p className={style.card__text}>Разрабатываем панель администратора для лёгкого редактирования вашего сайта</p>
            <p className={style.card__number}>03</p>
          </div>

          <div className={style.card + " " + style.card4} ref={card4}>
            <svg width="38" height="40" viewBox="0 0 38 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M10.1973 13.9653C10.9843 13.9653 11.6223 14.6014 11.6223 15.386C11.6223 16.1053 11.0862 16.6997 10.3907 16.7937L10.1973 16.8067H8.4075C5.44851 16.8067 3.02852 19.1132 2.85944 22.0201L2.85 22.3455V31.599C2.85 34.5595 5.17183 36.9801 8.09887 37.1492L8.4265 37.1586H29.5925C32.5528 37.1586 34.9716 34.8526 35.1406 31.9435L35.15 31.6179V22.3664C35.15 19.4042 32.8302 16.9852 29.903 16.8161L29.5754 16.8067H27.8027C27.0157 16.8067 26.3777 16.1707 26.3777 15.386C26.3777 14.6668 26.9138 14.0724 27.6093 13.9783L27.8027 13.9653H29.5754C34.0963 13.9653 37.7838 17.5136 37.9908 21.9708L38 22.3664V31.6179C38 36.1156 34.4485 39.7849 29.9883 39.9909L29.5925 40H8.4265C3.90595 40 0.216318 36.4503 0.00917252 31.9944L0 31.599V22.3455C0 17.8538 3.54693 14.1868 8.00023 13.975L8.4075 13.9653H10.1973ZM19.0004 0C19.7218 0 20.318 0.534472 20.4124 1.22791L20.4254 1.42069L20.425 20.7876L23.5311 17.6811C24.036 17.1757 24.8275 17.1282 25.3862 17.5398L25.5463 17.677C26.0533 18.1803 26.1009 18.9695 25.6881 19.5265L25.5505 19.6861L20.0101 25.2325C19.9634 25.2785 19.9159 25.32 19.8657 25.3583L20.0101 25.2325C19.9402 25.3025 19.8648 25.3637 19.7853 25.4161C19.7564 25.4345 19.7263 25.4527 19.6955 25.4699C19.676 25.4815 19.6564 25.4918 19.6366 25.5017C19.5971 25.5207 19.5562 25.5388 19.5144 25.5549C19.4928 25.5637 19.4713 25.5714 19.4497 25.5786C19.4101 25.5912 19.369 25.6028 19.3271 25.6126C19.3044 25.6184 19.2822 25.623 19.26 25.6271C19.2239 25.6333 19.1864 25.6387 19.1485 25.6426C19.1098 25.647 19.0717 25.6494 19.0336 25.6503C19.0224 25.65 19.0114 25.6501 19.0004 25.6501L18.969 25.6504C18.9303 25.6495 18.8915 25.6471 18.8529 25.6431L19.0004 25.6501C18.9114 25.6501 18.8243 25.642 18.7398 25.6264C18.7184 25.623 18.6961 25.6183 18.674 25.6131C18.6302 25.6025 18.5875 25.5903 18.5457 25.5763C18.526 25.5702 18.5064 25.5631 18.4869 25.5556C18.4465 25.5395 18.407 25.5222 18.3685 25.5032C18.3477 25.4936 18.3263 25.4824 18.3051 25.4706C18.2676 25.4489 18.2313 25.4264 18.1961 25.4024C18.1803 25.3923 18.1654 25.3817 18.1507 25.3708C18.0895 25.324 18.0395 25.2806 17.9928 25.234L17.9907 25.2325L12.4503 19.6861C11.8949 19.1302 11.8968 18.2307 12.4544 17.677C12.9614 17.1736 13.7531 17.1294 14.3101 17.5432L14.4697 17.6811L17.575 20.7876L17.5754 1.42069C17.5754 0.636066 18.2134 0 19.0004 0Z" fill="#200E32"/>
            </svg>
            <p className={style.card__title}>Хостинг</p>
            <p className={style.card__text}>Размещаем ваш сайт на быстром и удобном хостинге</p>
            <p className={style.card__number}>04</p>
          </div>

          <div className={style.card + " " + style.card5} ref={card5}>
            <svg width="38" height="40" viewBox="0 0 38 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M14.46 1.57598C17 -0.442023 20.56 -0.522023 23.178 1.33598L23.5 1.57598L35.678 11.318C37.018 12.356 37.84 13.898 37.98 15.576L38 15.978V32.196C38 36.376 34.698 39.776 30.56 39.996H26.58C24.678 39.958 23.14 38.478 23 36.618L22.98 36.336V30.618C22.98 29.996 22.518 29.478 21.9 29.376L21.72 29.356H16.378C15.74 29.376 15.22 29.836 15.14 30.436L15.12 30.618V36.318C15.12 36.436 15.098 36.576 15.08 36.676L15.06 36.718L15.038 36.856C14.8 38.558 13.4 39.856 11.66 39.978L11.4 39.996H7.82C3.64 39.996 0.22 36.718 0 32.596V15.978C0.018 14.276 0.76 12.696 2 11.596L14.46 1.57598ZM21.76 3.75598C20.24 2.53598 18.08 2.47798 16.48 3.53598L16.178 3.75598L4.018 13.558C3.32 14.076 2.9 14.856 2.8 15.676L2.778 15.996V32.196C2.778 34.856 4.858 37.036 7.5 37.196H11.4C11.84 37.196 12.22 36.898 12.278 36.478L12.32 36.118L12.34 36.016V30.618C12.34 28.478 13.98 26.738 16.08 26.576H21.72C23.858 26.576 25.598 28.218 25.76 30.318V36.336C25.76 36.756 26.06 37.118 26.46 37.196H30.178C32.858 37.196 35.038 35.138 35.198 32.516L35.22 32.196V15.996C35.198 15.138 34.84 14.336 34.22 13.738L33.96 13.516L21.76 3.75598Z" fill="#200E32"/>
            </svg>
            <p className={style.card__title}>Домен</p>
            <p className={style.card__text}>Подключаем соответствущий названию вашей компании доменный адрес</p>
            <p className={style.card__number}>05</p>
          </div>

          <div className={style.card + " " + style.card6} ref={card6}>
            <svg width="34" height="40" viewBox="0 0 34 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M15.7707 0.203379C16.5674 -0.0679018 17.436 -0.0679018 18.2313 0.204032L31.5149 4.73954C33.0041 5.24613 34 6.61089 34 8.14395V21.4273C34 25.4684 32.4972 29.3607 29.7889 32.3928C28.5111 33.8253 26.883 35.019 24.9135 36.0538L17.7316 39.8232C17.2828 40.0588 16.7421 40.0589 16.2932 39.8236L9.09862 36.0519C7.12385 35.0155 5.49591 33.8241 4.21824 32.3921C1.50581 29.3579 0 25.4629 0 21.4194V8.14395C0 6.61089 0.99593 5.24613 2.48348 4.7401L15.7707 0.203379ZM17.2261 2.97902C17.0808 2.92932 16.9199 2.92932 16.7732 2.97925L3.48566 7.51611C3.21099 7.60954 3.02778 7.8606 3.02778 8.14395V21.4194C3.02778 24.7522 4.26893 27.9626 6.50512 30.4641C7.52089 31.6026 8.8626 32.5844 10.537 33.4632L17.0101 36.8566L23.4739 33.4658C24.9344 32.6984 26.1445 31.8491 27.1051 30.8855L27.5015 30.4654C29.7336 27.9664 30.9722 24.7583 30.9722 21.4273V8.14395C30.9722 7.8606 30.789 7.60954 30.5127 7.51554L17.2261 2.97902ZM24.5106 14.4798C25.048 15.002 25.0969 15.8192 24.6572 16.395L24.5106 16.56L16.6424 24.2048C16.1048 24.7271 15.2636 24.7745 14.6709 24.347L14.5011 24.2045L10.6821 20.492C10.091 19.9174 10.0913 18.986 10.6826 18.4118C11.2203 17.8897 12.0613 17.8424 12.6539 18.2699L12.8236 18.4123L15.5709 21.0845L22.3696 14.4798C22.9608 13.9054 23.9194 13.9054 24.5106 14.4798Z" fill="#200E32"/>
            </svg>
            <p className={style.card__title}>SSL сертификат</p>
            <p className={style.card__text}>Подключаем к сайту сертификат безопасности</p>
            <p className={style.card__number}>06</p>
          </div>

          <div className={style.card + " " + style.card7} ref={card7}>
            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M19.2231 0C29.8397 0 38.4462 8.41638 38.4462 18.7985C38.4462 23.6981 36.5294 28.1599 33.3892 31.5059L39.565 37.5272C40.1439 38.0919 40.1451 39.0085 39.5677 39.5746C39.0428 40.0893 38.2205 40.1371 37.6403 39.7173L37.4741 39.5773L31.2254 33.4835C27.9363 36.0577 23.7635 37.597 19.2231 37.597C8.60647 37.597 0 29.1807 0 18.7985C0 8.41638 8.60647 0 19.2231 0ZM19.2231 2.89548C10.2417 2.89548 2.96087 10.0155 2.96087 18.7985C2.96087 27.5815 10.2417 34.7016 19.2231 34.7016C28.2045 34.7016 35.4853 27.5815 35.4853 18.7985C35.4853 10.0155 28.2045 2.89548 19.2231 2.89548Z" fill="#200E32"/>
            </svg>
            <p className={style.card__title}>Первичное SEO</p>
            <p className={style.card__text}>Делаем оптимизацию основных страниц для поисковой оптимизации</p>
            <p className={style.card__number}>07</p>
          </div>

          <div className={style.card + " " + style.card8} ref={card8}>
            <svg width="45" height="40" viewBox="0 0 45 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M32.2784 0C35.6428 0.0378907 38.8449 1.46208 41.139 3.94099C43.4332 6.41989 44.6191 9.73713 44.4236 13.0199L44.4206 26.8799C44.6191 30.2629 43.4332 33.5801 41.139 36.059C38.8449 38.5379 35.6428 39.9621 32.2596 40H12.1249C5.08144 40 0 34.3078 0 26.9801V13.0199C0 5.69225 5.08144 0 12.1249 0H32.2784ZM32.2408 3.3964H12.1249C7.02842 3.3964 3.37209 7.49234 3.37209 13.0199V26.9801C3.37209 32.5077 7.02842 36.6036 12.1249 36.6036H32.2408C34.6829 36.5762 37.0072 35.5424 38.6724 33.7431C40.3377 31.9437 41.1985 29.5358 41.0515 26.9801L41.0544 12.9198C41.1985 10.4642 40.3377 8.05629 38.6724 6.25694C37.0072 4.45759 34.6829 3.42383 32.2408 3.3964ZM35.609 12.5297C36.138 13.1954 36.0888 14.1391 35.5294 14.7456L35.3463 14.9168L26.2196 22.2747C24.003 24.015 20.9402 24.102 18.629 22.5279L18.2705 22.2655L9.08281 14.9212C8.35342 14.3381 8.23138 13.2699 8.81024 12.5352C9.33648 11.8674 10.2608 11.7051 10.9725 12.1191L11.179 12.2607L20.3551 19.5958C21.384 20.4035 22.7944 20.4657 23.8684 19.7929L24.1295 19.6094L33.2391 12.2651C33.966 11.679 35.0271 11.7975 35.609 12.5297Z" fill="#200E32"/>
            </svg>
            <p className={style.card__title}>Корпоративная почта</p>
            <p className={style.card__text}>Создаём уникальный почтовый индекс для ваших email</p>
            <p className={style.card__number}>08</p>
          </div>

        </div>

        <DecorativeSquare color="lightpurple" top="0" left="40px"/>
        <DecorativeSquare color="purple" top="0" left="0"/>
        <DecorativeSquare color="purple" top="-40px" left="-40px"/>
        <DecorativeSquare color="yellow" top="-40px" left="0"/>

      </div>
    </section>
  )
}

export default SolutionServices
